<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"e95f61bef94d8f03eedacaaf510fc6fe542976a010f7de3157b2597b40d54ba7","plan_job_ref":"Job Run Terraform plan in staging #162 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12815311183","plan_out_hash":"f892d16c2bb545b4efff5cf174c6c443f2ce4e9590b96fde82408f63b4e26087","plan_hash":"2fcb2cd3700666cc33bf7431b0e4b185d3acb6ea7d7b2e81ea9162f57b8ed924","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "i2ozWW+SIfbesVOcVZBYrzT7SQdjz42aRQZUbVpbOFs=" -> "UWVXITCW0FPoM/h8wHlvbVljy21wi3d64BHf+AqDs/M="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-15T16:06:51Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "ca5f85c09ec348f167c4f35d41633d93f0501ac09d0105912fa946a92ebbecd8" -> "3cd9d08dd2cee92fc231257cd7405254dc6d0cf0b4540c9e307eefd81beba0c4"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-16T18:19:00Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #162](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12815311183)